"""
    1. Python中单引号 ' 和双引号 " 使用完全相同.
    2. 使用三引号(\'''或\""")可以指定一个多行字符串.
    3. 转义符 \.
    4. 反斜杠可以用来转义，使用 r 可以让反斜杠不发生转义.
    5. Python 中的字符串有两种索引方式，从左往右从0开始，从右往左从-1开始.
    6. Python 中的字符串不能改变.
    7. Python 中没有单独的字符类型，一个字符就是长度为1的字符串.
    8. 字符串的截取的语法如下：变量[头下标:尾下标:步长].
"""

# ---------------------------------------01--------------------------------------------
print('Hello World \nThis is pycharm!')
print(r'Hello World \nThis is pycharm!')

# ---------------------------------------02--------------------------------------------
str = '123456789'
print(str)                                # 输出字符串
print(str[0:-1])                          # 输出第一个到倒数第二个的所有字符串（包头不包尾）
print(str[0])                             # 输出第一个字符
print(str[2:])                            # 输出第三个字符后所有的字符
print(str[1:5:2])                         # 输出第二个到第五个且每隔一个的字符（步长为2）
print(str * 2)                            # 输出字符串两遍
print(str + "👋")                         # 输出字符串拼接
print('Hello World \nThis is pycharm!')   # 使用反斜杠(\)+n 转义特殊字符
print(r'Hello World \nThis is pycharm!')  # 在字符串前面添加一个 r ，表示原始字符串，不会发生转义


# ---------------------------------------03--------------------------------------------
"""
    1. 缩进相同的一组语句构成一个代码块，称之为代码组.
    2. 像 if、while、def 和 class 这样的复合语句，首行以关键字开始，以冒号(:)结束，该行之后的一行挥多行代码构成代码组.
    3. 我们将首行及后面的代码称之为一个子句(clause)
    
    eg:
    if expression :
        suite
    elif expression :
        suite
    else :
        suite        
"""

a = 1
b = 2
if a > b:
    print("a > b")
elif a < b:
    print("a < b")
else:
    print("a == b")

# # ---------------------------------------04--------------------------------------------
"""
    print 默认输出是换行的，如果要实现不换行需要在变量末尾加上 end=""
"""
print("a")
print("b", end="")
print("c", end="")

